{"slides":[{"slide":"1","text":[{"type":"h3","text":"<strong class=serif>The Pudding</strong> presents"},{"type":"h1","text":"You should look at this chart about <span class=primary>music genres</span>."}]},{"slide":"2","text":[{"type":"p","text":"In 2016, Spotify began publishing a chart of popular genres on its platform."}]},{"slide":"3","text":[{"type":"p","text":"Let’s now fast forward six years later and see how the ranking has changed."}]},{"slide":"4","text":[{"type":"p","text":"I’ve highlighted the genres that are <strong class=secondary>not among the top 25 in 2016.</strong> I wondered why so many genres shifted in popularity."}]},{"slide":"5","text":[{"type":"p","text":"This led me down a rabbit hole to explore Spotify’s database of 6,000 genres, and it’s changed the way that I think about music."},{"type":"p","text":"So pull up a chair for a great dinner table discussion about genre. Before we launch into a philosophical debate about music, let’s start with something for casual music fans."}]},{"slide":"6","text":[{"type":"p","text":"In 2023, nearly half of the top 25 genres hail from <strong class=secondary>Latin America, Africa, and Asia.</strong>"}]},{"slide":"7","text":[{"type":"p","text":"This shouldn’t be surprising."},{"type":"p","text":"Today, Spotify users from North America and Europe represent a much smaller share of streams than in 2016."}]},{"slide":"8","text":[{"type":"p","text":"Every year, Spotify is available in more countries. Spotify was made available in South Korea in 2021. And India in 2019. Fittingly, you can see non-English genres begin to dominate in popularity."}]},{"slide":"9","text":[{"type":"p","text":"So many non-English genres have ascended in popularity: k-pop is, by far, the biggest gainer since 2016. Over the past 7 years, it’s ascended to the 19th most-streamed genre."}]},{"slide":"10","text":[{"type":"p","text":"<strong class=secondary>K-pop</strong> now has more streams than <strong>r&b</strong> and <strong>edm</strong>."}]},{"slide":"11","text":[{"type":"p","text":"You’ve probably heard of <span id=bad-bunny-audio>Bad Bunny</span>, the world’s most-streamed musician, three years running. Fittingly, <strong class=primary>reggaeton</strong> is the only other genre to exhibit a <strong>k-pop</strong>-like ascent."}]},{"slide":"12","text":[{"type":"p","text":"Does k-pop just feel popular because streaming is more global? Is reggaeton pervasive because we’re finally counting the true popularity of English-centric artists?"}]},{"slide":"13","text":[{"type":"p","text":"Next, let’s discuss the remaining 5,975 genres in Spotify’s dataset. Music nerds, pull up a chair."},{"type":"h2","text":"This dataset represents an ocean of of genres that represent an ongoing attempt to catalogue every music community."}]}]}