{"slides":[{"slide":"1","text":[{"type":"h3","text":"<strong class=serif>The Pudding</strong> presents"},{"type":"h1","text":"You should look at this chart about <span class=primary>music genres</span>."}]},{"slide":"2","text":[{"type":"p","text":"In 2016, Spotify began publishing a chart of popular genres on its platform."}]},{"slide":"3","text":[{"type":"p","text":"It gets interesting when you compare it to the 2023 data."}]},{"slide":"4","text":[{"type":"p","text":"I’ve highlighted the genres that are <strong class=secondary>not on the 2016 list</strong>, which set off a research project to uncover what happened."}]},{"slide":"5","text":[{"type":"p","text":"I discovered a big idea, one that changed how I think about music."},{"type":"p","text":"This is going to take some explaining, so let’s first tackle some obvious trends in the data."}]},{"slide":"6","text":[{"type":"h2","text":"First, what genres are more popular today than in 2016?"}]},{"slide":"7","text":[{"type":"p","text":"In 2016, <strong class=secondary>k-pop</strong> was the 283rd most-streamed genre."}]},{"slide":"8","text":[{"type":"p","text":"Over the past 7 years, it’s ascended to the 17th most-streamed genre."}]},{"slide":"9","text":[{"type":"p","text":"Incredibly, <strong class=secondary>k-pop</strong> has more streams than <strong>R&B</strong> and <strong>EDM</strong>."}]},{"slide":"10","text":[{"type":"p","text":"You’ve probably heard of <span id=bad-bunny-audio>Bad Bunny</span>, the world’s most-streamed musician, three years running. Fittingly, <strong class=primary>reggaeton</strong> is the only other genre to exhibit a <strong>k-pop</strong>-like ascent."}]},{"slide":"11","text":[{"type":"h2","text":"The Geography of Streaming"},{"type":"p","text":"Reggaeton’s ascent should be surprising. Today, Spotify users from North America and Europe represent a much smaller share of streams than in 2016."}]},{"slide":"12","text":[{"type":"p","text":"Every year, Spotify is available in more countries. Spotify added South Korea in 2021. And India in 2019. Fittingly, you can see non-English genres begin to dominate in popularity."}]},{"slide":"13","text":[{"type":"p","text":"Zooming into the top 25, nearly half of genres hail from <strong class=secondary>Latin America, Africa, and Asia</strong>."}]}]}