{"sections":{"1":"Intro tk","2":"Regions tk","3":"Taxonomy tk"},"artists":{"bad-bunny":"https://p.scdn.co/mp3-preview/5c80aedfe75d2bc15aa0e803993c43395d8054fe?cid=5e546a6e15b04d54985d7d3538e3d5d5","cloudymane":"https://p.scdn.co/mp3-preview/7ed965d5e417a5aad558d203f02b49248fe57b72?cid=5e546a6e15b04d54985d7d3538e3d5d5","kobelocks":"https://p.scdn.co/mp3-preview/37a23d19a218128e0fa97d2915821c2ffe76ccc0?cid=5e546a6e15b04d54985d7d3538e3d5d5","scarlxrd":"https://p.scdn.co/mp3-preview/e65f8731b39d8fdb92d40c5cfd0d62faa8302b9f?cid=5e546a6e15b04d54985d7d3538e3d5d5","lei":"https://p.scdn.co/mp3-preview/0ba5bbee744c3f032ecaa44dff1766b2938c4ef0?cid=5e546a6e15b04d54985d7d3538e3d5d5"},"slides":[{"slide":"1","section":"1","text":[{"type":"h3","text":"<strong class=serif>The Pudding</strong> presents"},{"type":"h1","text":"You should look at this chart about <span class=primary>music genres</span>."}]},{"slide":"2","section":"1","text":[{"type":"p","text":"In 2016, Spotify began publishing a list of the most popular music genres on its platform."}]},{"slide":"3","section":"1","text":[{"type":"p","text":"Let’s now fast forward six years and see the ranking for 2023."}]},{"slide":"4","section":"1","text":[{"type":"p","text":"I’ve highlighted the genres that were <strong class=secondary>new to the top 25 and absent from the 2016 list</strong>. I wondered why so many genres shifted in popularity."}]},{"slide":"5","section":"1","text":[{"type":"p","text":"This led me down a rabbit hole to explore Spotify’s database of 6,000 genres. It’s changed the way that I think about music."},{"type":"p","text":"So get cozy, as we’re going to explore the semantics of genres. But before we get too analytical, let’s start with something for the casual music fans."}]},{"slide":"6","section":"2","text":[{"type":"p","text":"In 2023, nearly half of the top 25 genres hail from <strong class=secondary>Latin America, Africa, and Asia.</strong>"}]},{"slide":"7","section":"2","text":[{"type":"p","text":"This shouldn’t be surprising."},{"type":"p","text":"Today, Spotify users from North America and Europe represent a much smaller share of streams than in 2016."}]},{"slide":"8","section":"2","text":[{"type":"p","text":"Every year, Spotify is available in more countries. Spotify was made available in South Korea in 2021. And India in 2019. Fittingly, you can see non-English genres begin to dominate in popularity."}],"annotation":"The genre “Filmi” (music from Indian Cinema) is now the 8th most-streamed genre on Spotify."},{"slide":"9","section":"2","text":[{"type":"p","text":"So many non-English genres have ascended in popularity: <strong class=secondary>k-pop</strong> is, by far, the biggest gainer since 2016. Over the past 7 years, it’s ascended to the 19th most-streamed genre."}]},{"slide":"10","section":"2","text":[{"type":"p","text":"<strong class=secondary>K-pop</strong> now has more streams than <strong>r&b</strong> and <strong>edm</strong>."}]},{"slide":"11","section":"2","text":[{"type":"p","text":"You’ve probably heard of <span id=bad-bunny-audio>Bad Bunny</span>, the world’s most-streamed musician, three years running. Fittingly, <strong class=primary>reggaeton</strong> is the only other genre to exhibit a <strong>k-pop</strong>-like ascent."}]},{"slide":"12","section":"2","text":[{"type":"p","text":"Non-English songs have never been more popular. But does k-pop feel popular because we’re seeing more signal from different music fans? Is reggaeton seemingly pervasive because we’re finally counting the true popularity of English-centric artists?"},{"type":"p","text":"Popularity is such a self-fulfilling loop: we obsess over what’s popular (especially in the US), pushing top-charting artists further into the cultural spotlight."}]},{"slide":"13","section":"2","text":[{"type":"p","text":"So is the recent shift in music taste real? Noodle on that for a bit."},{"type":"p","text":"Next, we’re going to get academic about the not so popular genres. Music nerds, this section is for you."},{"type":"h2","text":"Below the top 25 is an ocean of over 5,000 genres. It’s part of an ongoing effort to catalogue every music community."}]},{"slide":"14","section":"3","text":[{"type":"p","text":"This includes subdividing vague, sprawling categories, such as rock, hip hop, and pop, into a rigorous classification of over 6,000 genres."},{"type":"p","text":"And you can see this effort play out in real-time. For example, <strong class=secondary>latin</strong> reigned as a top 10 genre until it was dropped from the genre list in late 2022."}]},{"slide":"15","section":"3","text":[{"type":"p","text":"Before it was removed, Latin seemed like a vestigial genre from record store days, encompassing anything Spanish-language, from Carlos Vives to Bad Bunny."}]},{"slide":"16","section":"3","text":[{"type":"p","text":"Latin already overlapped with other genres like Latin Pop, so Spotify removed it and subsequently added Urbano Latino to its genre list, which is narrower in scope than Latin, centered more on reggaeton and trap."}]},{"slide":"17","section":"3","text":[{"type":"p","text":"Hip hop and rock are similarly so broad that if I were to tell you that they were ranked #4 and #5 respectively, that wouldn’t say much."},{"type":"p","text":"For example, consider the different sounds of these “hip hop” tracks."}]},{"slide":"18","section":"3","text":[{"type":"p","text":"Hip hop has evolved so much over the past 50 years; today it’s a kaleidoscope of communities making all types of music. Spotify has hundreds of genres that overlap with hip hop, and many were added in the past few years."}]},{"slide":"19","section":"3","text":[{"type":"p","text":"So Spotify’s genre catalogue not only recognizes the breadth of music within hip hop and other genres, but also identifies new styles."},{"type":"p","text":"Here’s a few genres added to the database in 2023, and many classify older music communities."}]},{"slide":"20","section":"3","text":[{"type":"p","text":"You probably haven’t heard of these genres because Spotify coined them. Glenn McDonald, who leads much of Spotify’s genre research, discussed in a podcast <a href=https://open.spotify.com/episode/2qXXNqMVWQZ89QTtRWEXrj?si=09376bda34884085&nd=1 target=_blank>interview</a> why this happens:"}],"quote":"“We do recognize the existence of genres that are mainly driven by listening patterns and not necessarily by the artists thinking of themselves as being peers… we can find clusters of listeners who share fondness for the same artists, even when it's not necessarily obvious that those artists share a style, and they don't necessarily come from the same place. But we can see that, yes, fans of these artists tend to be fans of the others.”"},{"slide":"21","section":"3","text":[{"type":"p","text":"This includes “Escape Room,” Spotify’s 260th most streamed genre. McDonald <a href=https://festivalpeak.com/what-is-escape-room-and-why%20-is-it-one-of-my-top-genres-on-spotify-a886372f003f target=_blank>describes it</a> as “The vibe is kind of an underground-trap/PC-music/indietronic/activist-hip-hop kind of thing.”"}]},{"slide":"22","section":"3","text":[{"type":"p","text":"This goes for older music too. Rock music is so diffuse that it makes sense to retroactively further catalogue it, as they did with <strong>mellow rock</strong> (elements of soft rock and folk rock, with emphasis on clean production, harmonies, and melodic compositions)."}]},{"slide":"23","section":"3","text":[{"type":"p","text":"Arbitrary creating a genre might seem ridiculous. Yet a full genre taxonomy no doubt helps Spotify build a better profile of my music tastes. And for music nerds, it doubles as a window into the the ebb and flow of musical culture."}]},{"slide":"24","section":"3","text":[{"type":"p","text":"I’ve seen pushback to these genres, especially the “made-up” ones. They often show up on the “top genres” list for users’ year-end report."}]},{"slide":"25","section":"3","text":[{"type":"p","text":"I get it. The data includes the newly-christened Stomp and Holler genre,  described by Spotify’s McDonald to include “those rousing neo-rustic folk/pop-ish artists, like Mumford & Sons and the Lumineers, that kind of sound like Dave Matthews ran over a jug band.”"},{"type":"p","text":"But I will never be caught dead saying, “I listen to Stomp and Holler.”"}]},{"slide":"26","section":"3","text":[{"type":"p","text":"Come to think about it, that goes for many nascent genres. If I described my music taste as drift phonk, math rock, or bedroom pop, I’m inviting a level of cringe and pretentiousness."},{"type":"p","text":"That goes for new mainstream genres too. Spotify is credited with coining <strong>Hyperpop</strong>, which is now a part of popular culture and music discourse. But that didn’t stop it from being ridiculed."}]},{"slide":"27","section":"3","text":[{"type":"p","text":"Artists, especially, seem to struggle when their music is associated with new genres."},{"type":"p","text":"Consider Yacht Rock: it was coined in the late 2000s to describe the feel-good ’80s grooves of the likes of Eagles, Doobie Brothers, and Hall & Oates."},{"type":"p","text":"Yacht Rock is 154th most popular genre on Spotify, even though John Oates (the Oates of Hall & Oates) had never heard of the term and questions its meaning."}]},{"slide":"28","section":"3","text":[{"type":"p","text":"Artist rarely have control over how their music is categorized.  Lil Nas X’s “Old Town Road” stirred controversy when it wasn’t initially classified as a country song by Billboard."},{"type":"p","text":"In a post-award speech, Tyler, the Creator pushed back at his Grammy nomination for Best Rap Album."}]},{"slide":"29","section":"3","text":[{"type":"p","text":"Five years ago, I was researching the history of Billboard’s “Hot Rap Songs” chart. Before 1989, I was surprised to learn that it was the “Hot Black Singles” chart. And before that, “Race Records.” And before that, “Colored Records.”"}]},{"slide":"30","section":"3","text":[{"type":"h2"},{"type":"p","text":"Sometimes genre has to do with an audience (e.g., race records)."},{"type":"p","text":"Sometimes it’s values-driven (e.g., riot grrrl, straight edge). Or lifestyle (e.g., punk)."},{"type":"p","text":"Sometimes it comes down to economics (e.g., indie)."},{"type":"p","text":"Sometimes it’s rejected or embraced, depending on the era (e.g., emo)."},{"type":"p","text":"When genre can mean so many different things, who is to say whether a genre is “real?”"}]},{"slide":"31","section":"3","text":[{"type":"h2","text":"The way we talk normal people talk about music, particularly with genre labels, moves far slower than music itself."},{"type":"p","text":"When emerging music defies genre conventions, it could take years to coalesce around a new vernacular."},{"type":"p","text":"Hip Hop celebrates its 50th anniversary this year, born in 1973. But it wasn’t until the late ’70s that the genre was called “hip hop.” The same goes for the Velvet Underground and punk music. We might call these artists proto-hip hop or proto-punk, because sometimes music is different and it's only until years after the fact that we realize what it was."}]},{"slide":"32","section":"3","text":[{"type":"p","text":"The 6,000 genre dataset is deeply academic work that can exist in a separate plane from how we casually talk about music."},{"type":"p","text":"I can still call a fig a fruit, even though technically it’s an edible inverted flower. Honey Badgers are still badgers, even though they are actually more related to weasels."}]},{"slide":"33","section":"3","text":[{"type":"p","text":"Music is on evolutionary steroids. It’s a petri dish of organisms that’s evolving and going extinct in mere months."}]},{"slide":"34","section":"3","text":[{"type":"p","text":"How close is this thing to its neighboring sounds?"}]},{"slide":"35","section":"3","text":[{"type":"p","text":"Will it one day grow into something bigger?"}]}]}