{"sections":{"1":"Intro tk","2":"Regions tk","3":"Taxonomy tk"},"artists":{"chino-nacho":"https://p.scdn.co/mp3-preview/a716ca54b29628150ba430b426e27a5c4d3ac413","becky-g":"https://p.scdn.co/mp3-preview/0a699c30d354c4cb36439d03522e65b377ac0fd8","luis-fonsi":"https://p.scdn.co/mp3-preview/2ea246524bf5a1a6432d4cf1b911a98bd84e3e8e","john-mellancamp":"https://p.scdn.co/mp3-preview/b03b592db51b8b06e0b04b538630912849195a14","van-halen":"https://p.scdn.co/mp3-preview/86b253d59e8485604c5cdcba34b67caa9307c17f","the-fray":"https://p.scdn.co/mp3-preview/30d90238cdd10ea0a938ddc8ec122dabb87ac035","lord-huron":"https://p.scdn.co/mp3-preview/d563a6c29fb2e51cb10b638ab4f2409f0bf9d398","of-monsters-and-men":"https://p.scdn.co/mp3-preview/a5dad05d521739606a83da0f00d3dc48344c6d77","iron-and-wine":"https://p.scdn.co/mp3-preview/93df2b8b89294a5305d33c8fd95828162aa1cab0","dj-eladji":"https://p.scdn.co/mp3-preview/71cb5fae11a9c6ff8f665a049646583407c7f2d4","noixes":"https://p.scdn.co/mp3-preview/1b0b7318fcc95eb5f38ea5ba0758b728baae6483","lauge":"https://p.scdn.co/mp3-preview/a55b18646a1f51930177e3d16d6902d280e5419e","james-lr":"https://p.scdn.co/mp3-preview/4ec2ce4e9d6aa1c7d62f07bdeb157953ee113003","anton-ishutin":"https://p.scdn.co/mp3-preview/b5e106e005eab3da106b093f40ecca16a183b6fe","anthonyxmoore":"https://p.scdn.co/mp3-preview/93a68e611de7d7b1fd0540d3ed2cfe7899e07ce2","fyex":"https://p.scdn.co/mp3-preview/1eb10726da7c4823c954c358a12ad2c530ff3fdf","oston":"https://p.scdn.co/mp3-preview/f8ad85f6654b072d204c7d8ae53382496c1f3f09","dj-guzin":"https://p.scdn.co/mp3-preview/37238ba039c09ab4696deafd379a3b43b9d0e467","milord":"https://p.scdn.co/mp3-preview/3826899561f99eacc48c19cab6273c2c381fefc6","andruss":"https://p.scdn.co/mp3-preview/e031212f30ecd88a37a1d64865dfd3f3e5a323fa","smoo-vth":"https://p.scdn.co/mp3-preview/8cfbad0d916fba5288c028b4bce497038d8aa536","elegy-of-madness":"https://p.scdn.co/mp3-preview/2df99daeea1879545fce3fef01c7a67f352d9ff0","hetty-koes-endang":"https://p.scdn.co/mp3-preview/7c2d67c8a8e5c8a7ef521201597965abd0323401","porayni-soren":"https://p.scdn.co/mp3-preview/45ec596907910e3ba379202df91ae16c185e79d6","omar-apollo":"https://p.scdn.co/mp3-preview/547ef328c7576928afca787e3e18cae67a38e07d","carlos-vives":"https://p.scdn.co/mp3-preview/6c11e10bf650a09d004aa64ce8b65be3b3c9e901","romeo-santos":"https://p.scdn.co/mp3-preview/517abecfde814f6ecb4459b4d2ff4c250ed80ec5","anderson-paak":"https://p.scdn.co/mp3-preview/698393b356883b6320687398d31d272242758ef8","lizzo":"https://p.scdn.co/mp3-preview/eccfdcaa8806d35934078840b549adc92f01fbff","kaytranada":"https://p.scdn.co/mp3-preview/f8a126e1c8c8b741ecfa53e0bb9f6ea7b2fb7e0b","yaeji":"https://p.scdn.co/mp3-preview/9a02a03a1549c3b27b66a2e152922ff7f7138ae6","juan-gabriel":"https://p.scdn.co/mp3-preview/9313ed81c965b56288b61bcff88a8271a12a78a5","bad-bunny":"https://p.scdn.co/mp3-preview/5c80aedfe75d2bc15aa0e803993c43395d8054fe?cid=5e546a6e15b04d54985d7d3538e3d5d5","cloudymane":"https://p.scdn.co/mp3-preview/7ed965d5e417a5aad558d203f02b49248fe57b72?cid=5e546a6e15b04d54985d7d3538e3d5d5","kobelocks":"https://p.scdn.co/mp3-preview/37a23d19a218128e0fa97d2915821c2ffe76ccc0?cid=5e546a6e15b04d54985d7d3538e3d5d5","scarlxrd":"https://p.scdn.co/mp3-preview/e65f8731b39d8fdb92d40c5cfd0d62faa8302b9f?cid=5e546a6e15b04d54985d7d3538e3d5d5","lei":"https://p.scdn.co/mp3-preview/0ba5bbee744c3f032ecaa44dff1766b2938c4ef0?cid=5e546a6e15b04d54985d7d3538e3d5d5"},"slides":[{"slide":"1","section":"1","text":[{"type":"h3","text":"<a target=_blank href=https://pudding.cool/ target=_blank><strong class=pudding>The Pudding</strong></a> presents"},{"type":"h1","text":"You should look at this chart about <span class=primary>music genres</span>."}],"title":"Genres, ranked by streams on Spotify"},{"slide":"2","section":"1","text":[{"type":"p","text":"In 2016, Spotify began publishing a list of the most popular music genres on its platform."}],"title":"Genres, ranked by streams on Spotify"},{"slide":"3","section":"1","text":[{"type":"p","text":"Let’s now fast forward six years to the ranking in 2023."}],"title":"Genres, ranked by streams on Spotify"},{"slide":"4","section":"1","text":[{"type":"p","text":"I’ve highlighted the genres that were <strong class=secondary>new to the top 25 and absent from the 2016 list</strong>. I wondered why so many genres shifted in popularity."}],"title":"Genres, ranked by streams on Spotify"},{"slide":"5","section":"1","text":[{"type":"p","text":"This led me down a rabbit hole to explore Spotify’s database of 6,000 genres. It’s changed the way that I think about music."},{"type":"p","text":"So get cozy, as we’re going to explore the semantics of genres. But before we get too analytical, let’s start with something for the casual music fans."}],"title":"Genres, ranked by streams on Spotify"},{"slide":"6","section":"2","text":[{"type":"p","text":"In 2023, nearly half of the top 25 genres hail from <strong class=secondary>Latin America, Africa, and Asia.</strong>"}],"title":"Genres, ranked by streams on Spotify"},{"slide":"7","section":"2","text":[{"type":"p","text":"This shouldn’t be surprising."},{"type":"p","text":"Today, Spotify users from North America and Europe represent a much smaller share of streams than in 2016."}],"title":"Spotify Streams, by Region"},{"slide":"8","section":"2","text":[{"type":"p","text":"Every year, Spotify is available in more countries. Spotify was made available in South Korea in 2021. And India in 2019. Fittingly, you can see non-English genres begin to dominate in popularity."}],"title":"Genres, ranked by streams on Spotify","annotation":"The genre “Filmi” (music from Indian cinema) is now the 8th most-streamed genre."},{"slide":"9","section":"2","text":[{"type":"p","text":"So many non-English genres have ascended in popularity: <strong class=secondary>k-pop</strong> is, by far, the biggest gainer since 2016. Over the past 7 years, it grew to the 19th most-streamed genre."}],"title":"Genres, ranked by streams on Spotify"},{"slide":"10","section":"2","text":[{"type":"p","text":"<strong class=secondary>K-pop</strong> now has more streams than <strong>r&b</strong> and <strong>edm</strong>."}],"title":"Genres, ranked by streams on Spotify"},{"slide":"11","section":"2","text":[{"type":"p","text":"You’ve probably heard of <span id=bad-bunny-audio>Bad Bunny</span>, the world’s most-streamed musician, three years running. Fittingly, <strong class=primary>reggaeton</strong> is the only other genre to exhibit a <strong>k-pop</strong>-like ascent."}],"title":"Genres, ranked by streams on Spotify"},{"slide":"12","section":"2","text":[{"type":"p","text":"Non-English songs have never been more popular. But does k-pop feel popular because we’re tapped into the taste of different music fans? Is reggaeton seemingly pervasive because we’re finally counting the popularity of musicians on a global stage?"},{"type":"p","text":"Popularity is such a self-fulfilling loop: we obsess over what’s popular (especially in the US), pushing top-charting artists further into the cultural spotlight."}]},{"slide":"13","section":"2","text":[{"type":"p","text":"Next, we’re going to get academic about the not so popular genres. Music nerds, this section is for you."},{"type":"h2","text":"Below the top 25 ranking are genres #26 to #6,000 (and counting), all part of an on-going effort to catalog every music community."}]},{"slide":"14","section":"3","text":[{"type":"p","text":"These thousands of genres cut through sprawling categories, such as rock, hip hop, and pop."},{"type":"p","text":"And you can see this effort to rigorously classify music in real-time. For example, <strong class=secondary>latin</strong> reigned as a top 10 genre until it was dropped from Spotify's genre classification entirely in late 2022."}]},{"slide":"15","section":"3","text":[{"type":"p","text":"Before it was removed, Latin seemed like a vestigial genre from record store days, a potpourri of anything Spanish-language, from Juan Gabriel to Bad Bunny."}]},{"slide":"16","section":"3","text":[{"type":"p","text":"Spotify’s Latin genre already overlapped with other genres like Latin Pop, so Spotify removed it and subsequently added Urbano Latino to its genre list, which is narrower in scope than Latin, centered more on reggaeton and trap."}]},{"slide":"17","section":"3","text":[{"type":"p","text":"Hip hop and rock are similarly so broad that if I were to tell you that they were ranked #4 and #5 respectively, that wouldn’t say much (most pop music is some derivation of rock)."},{"type":"p","text":"For example, consider the different sounds of these “hip hop” tracks."}]},{"slide":"18","section":"3","text":[{"type":"p","text":"Hip hop has evolved so much over the past 50 years; today it’s a kaleidoscope of varied sounds and communities. Spotify has hundreds of genres that overlap with hip hop, and many were added in the past few years."}]},{"slide":"19","section":"3","text":[{"type":"p","text":"So Spotify’s genre catalogue not only recognizes the breadth of music within hip hop and other genres, but identifies new styles as well."},{"type":"p","text":"Here are the latest genres added in 2023 (note: some have always existed, but just were yet to be cataloged in Spotify’s dataset)."}]},{"slide":"20","section":"3","text":[{"type":"p","text":"Some of these genres might seem made-up; that’s because a few are. Glenn McDonald, who leads much of Spotify’s genre research, discussed in an <a target=_blank href=https://open.spotify.com/episode/2qXXNqMVWQZ89QTtRWEXrj?si=09376bda34884085&nd=1 target=_blank>interview</a> why this happens: when people consistently stream a cluster of artists, it could signal a valid genre."}],"quote":"“We do recognize the existence of genres that are mainly driven by listening patterns and not necessarily by the artists thinking of themselves as being peers… we can find clusters of listeners who share fondness for the same artists, even when it's not necessarily obvious that those artists share a style, and they don't necessarily come from the same place. But we can see that, yes, fans of these artists tend to be fans of the others.”"},{"slide":"21","section":"3","text":[{"type":"p","text":"An example of a genre driven by “listening patterns'' includes Escape Room, Spotify’s 260th most streamed genre. McDonald <a target=_blank href=https://festivalpeak.com/what-is-escape-room-and-why%20-is-it-one-of-my-top-genres-on-spotify-a886372f003f target=_blank>describes it</a> as “The vibe is kind of an underground-trap/PC-music/indietronic/activist-hip-hop kind of thing.”"}]},{"slide":"22","section":"3","text":[{"type":"p","text":"This goes for older music too. Rock music is so diffuse that it makes sense to retroactively further catalog it, as <a target=_blank href=https://newsroom.spotify.com/2022-11-30/learn-about-those-music-genres-you-may-not-have-heard-of>they did</a> with <strong>mellow rock</strong> (“elements of soft rock and folk rock, with emphasis on clean production, harmonies, and melodic compositions”)."}]},{"slide":"23","section":"3","text":[{"type":"p","text":"Arbitrary creating a genre might seem ridiculous. Yet a full genre taxonomy no doubt helps Spotify build a better profile of my music tastes. And for music nerds, it doubles as a window into the the ebb and flow of musical culture."}]},{"slide":"24","section":"3","text":[{"type":"p","text":"I’ve seen pushback to these genres, especially the “made-up” ones. They often show up on the “top genres” list for users’ year-end report."}]},{"slide":"25","section":"3","text":[{"type":"p","text":"I get it. Spotify’s <strong>Stomp and Holler</strong> genre is <a target=_blank href=https://www.furia.com/page.cgi?type=log&id=427>described</a> by McDonald to include “those rousing neo-rustic folk/pop-ish artists, like Mumford & Sons and the Lumineers, that kind of sound like Dave Matthews ran over a jug band.”"},{"type":"p","text":"But I will never be caught dead saying, “I listen to Stomp and Holler.”"}]},{"slide":"26","section":"3","text":[{"type":"p","text":"Come to think about it, that goes for many nascent genres. If I described my music taste as drift phonk, math rock, or bedroom pop, that’d be inviting cringe and pretentiousness."},{"type":"p","text":"That goes for new mainstream genres too. Spotify is credited with coining <strong>Hyperpop</strong>, which is now a part of popular culture and music discourse. But that didn’t stop it from being ridiculed."}]},{"slide":"27","section":"3","text":[{"type":"p","text":"Artists, especially, seem to struggle when their music is associated with new genres."},{"type":"p","text":"Consider Yacht Rock: coined in the late ’00s, it describes the feel-good ’80s grooves of many songs from bands like the Eagles, Doobie Brothers, and Daryl Hall & John Oates."},{"type":"p","text":"Yacht Rock is 154th most popular genre on Spotify, even though John Oates (the “Oates” of Hall & Oates) had never heard of the term."}]},{"slide":"28","section":"3","text":[{"type":"p","text":"Artists rarely have control over how their music is categorized. Lil Nas X’s “Old Town Road” stirred controversy when it wasn’t initially classified as a country song by Billboard."},{"type":"p","text":"In a post-award speech, Tyler, the Creator pushed back at his Grammy nomination for Best Rap Album."}]},{"slide":"29","section":"3","text":[{"type":"p","text":"Tyler has a point. Billboard’s “Hot R&B/Hip-Hop Songs” chart was once named “Hot Black Singles” and even “Race Records,” all stemming from a 75-year effort to racially divide music charts."}],"title":"How the name of Billboard’s “Hot R&B” Chart has evolved","footer":"Source: <i>Categorizing Sound</i> by David Brackett."},{"slide":"30","section":"3","text":[{"type":"p","text":"So all of the pushback against Escape Room, Stomp & Holler, and even what qualifies as R&B vs. Pop is valid."},{"type":"p","text":"But I still think an always-updating catalogue of 6,000 genres is groundbreaking."}]},{"slide":"31","section":"3","text":[{"type":"h2","text":"I see this effort in the same way I see taxonomy: technically accurate, colloquially useless."},{"type":"p","text":"For centuries we had generic names to identify animals, such as “fish.” Everything from squid to crabs (and obviously jellyfish) were lumped into the same “fish” bucket."},{"type":"p","text":"But on closer inspection, most of these animals were not related at all, and scientists have drawn boundaries between animals that we mindlessly lumped together."}]},{"slide":"32","section":"3","text":[{"type":"p","text":"Similarly, the genre database adds detail to crude labels, like hip hop, rock and indie, which helps in a research context (and to build music taste profiles for millions of people)."},{"type":"p","text":"But these terms don’t necessarily work in casual conversation: describe your music taste as indie, even if, technically, Spotify has a better label for it. And people can still call figs a fruit, even though it’s an inverted flower. Honey Badgers will always be badgers to me, even though they are more related to weasels."}],"title":"A small sample of genres within “indie” music"},{"slide":"33","section":"3","text":[{"type":"h2","text":"This approach means we can catalog music scenes that culture is typically too slow to name."},{"type":"p","text":"Hip hop officially celebrates its 50th anniversary this year, so 1973 marks its birth, the year that DJ Kool Herc mixed three breakbeats together. But it wasn’t until the late ’70s that the genre had a name."}],"overlay":"“Rapper’s Delight” (1979), or “Old School Hip Hop” according to Spotify"},{"slide":"34","section":"3","text":[{"type":"p","text":"The same goes for the Velvet Underground and The Stooges, the progenitors of punk, who both preceded the phrase “punk music.”"},{"type":"p","text":"In 1969, Rolling Stone reviewed The Stooges first album, fittingly calling it, “Rock and Roll,” as well as “loud,” “high-powered,” and “raw energy.” Imagine the audacity should they have characterized it as the precipice of a new genre."}],"overlay":"The Stooges, Goose Lake Festival, 1970 <span class=sub>(full video)</span>"},{"slide":"35","section":"3","text":[{"type":"p","text":"It’s hard to see how special something is, right in the moment."},{"type":"p","text":"If you’re old enough, you can look at the music scenes of your youth with awe, realizing that the pop music wasn’t just pop, but a marker of the era."},{"type":"p","text":"Right now, there’s some benign song that will, one day, represent a sound that’s quintessentially of the year 2023, and it will probably have a name."}],"overlay":"NSYNC at MTV Spring Break, 1999 <span class=sub>(at the time, this seemed normal and I never would have imagined it’d embody late ’90s aesthetics)</span>"},{"slide":"36","section":"3","text":[{"type":"p","text":"There are over 100,000 songs published to Spotify daily. To classify this music is to examine the petri dish of music culture that is mutating and evolving in mere months, and attempt to sort it."}],"title":"A Sample of the New Music from October 2023"},{"slide":"37","section":"3","text":[{"type":"p","text":"I’m glad that there’s a public resource that’s examining (and labeling) whatever thing is emerging from the agar."}]}]}