{"title":"You should look at this chart about music genres","description":"How Spotify's expanding catalog reflects 2023's musical frontier","url":"","keywords":"music, genre, spotify","dataLink":"https://docs.google.com/spreadsheets/d/1BWHO9TLmCtJIKeC63HuVtjHfwb6iBOAxe-_HBFJ-FHI/edit?usp=sharing","sections":{"1":"Intro","2":"Genres","3":"Taxonomy"},"artists":{"chino-nacho":"https://p.scdn.co/mp3-preview/2e3748e2df623e59b48fc717faffbe77dc565aff","becky-g":"https://p.scdn.co/mp3-preview/0a699c30d354c4cb36439d03522e65b377ac0fd8","luis-fonsi":"https://p.scdn.co/mp3-preview/2ea246524bf5a1a6432d4cf1b911a98bd84e3e8e","john-mellancamp":"https://p.scdn.co/mp3-preview/b03b592db51b8b06e0b04b538630912849195a14","van-halen":"https://p.scdn.co/mp3-preview/86b253d59e8485604c5cdcba34b67caa9307c17f","the-fray":"https://p.scdn.co/mp3-preview/30d90238cdd10ea0a938ddc8ec122dabb87ac035","lord-huron":"https://p.scdn.co/mp3-preview/d563a6c29fb2e51cb10b638ab4f2409f0bf9d398","of-monsters-and-men":"https://p.scdn.co/mp3-preview/a5dad05d521739606a83da0f00d3dc48344c6d77","iron-and-wine":"https://p.scdn.co/mp3-preview/93df2b8b89294a5305d33c8fd95828162aa1cab0","dj-eladji":"https://p.scdn.co/mp3-preview/71cb5fae11a9c6ff8f665a049646583407c7f2d4","noixes":"https://p.scdn.co/mp3-preview/1b0b7318fcc95eb5f38ea5ba0758b728baae6483","lauge":"https://p.scdn.co/mp3-preview/a55b18646a1f51930177e3d16d6902d280e5419e","james-lr":"https://p.scdn.co/mp3-preview/4ec2ce4e9d6aa1c7d62f07bdeb157953ee113003","anton-ishutin":"https://p.scdn.co/mp3-preview/b5e106e005eab3da106b093f40ecca16a183b6fe","anthonyxmoore":"https://p.scdn.co/mp3-preview/93a68e611de7d7b1fd0540d3ed2cfe7899e07ce2","fyex":"https://p.scdn.co/mp3-preview/1eb10726da7c4823c954c358a12ad2c530ff3fdf","oston":"https://p.scdn.co/mp3-preview/f8ad85f6654b072d204c7d8ae53382496c1f3f09","dj-guzin":"https://p.scdn.co/mp3-preview/37238ba039c09ab4696deafd379a3b43b9d0e467","milord":"https://p.scdn.co/mp3-preview/3826899561f99eacc48c19cab6273c2c381fefc6","andruss":"https://p.scdn.co/mp3-preview/e031212f30ecd88a37a1d64865dfd3f3e5a323fa","smoo-vth":"https://p.scdn.co/mp3-preview/8cfbad0d916fba5288c028b4bce497038d8aa536","elegy-of-madness":"https://p.scdn.co/mp3-preview/2df99daeea1879545fce3fef01c7a67f352d9ff0","hetty-koes-endang":"https://p.scdn.co/mp3-preview/7c2d67c8a8e5c8a7ef521201597965abd0323401","porayni-soren":"https://p.scdn.co/mp3-preview/45ec596907910e3ba379202df91ae16c185e79d6","omar-apollo":"https://p.scdn.co/mp3-preview/547ef328c7576928afca787e3e18cae67a38e07d","carlos-vives":"https://p.scdn.co/mp3-preview/e28b4480b179d5bc134ff3ee384e35e0841594d9","romeo-santos":"https://p.scdn.co/mp3-preview/517abecfde814f6ecb4459b4d2ff4c250ed80ec5","anderson-paak":"https://p.scdn.co/mp3-preview/698393b356883b6320687398d31d272242758ef8","lizzo":"https://p.scdn.co/mp3-preview/eccfdcaa8806d35934078840b549adc92f01fbff","kaytranada":"https://p.scdn.co/mp3-preview/f8a126e1c8c8b741ecfa53e0bb9f6ea7b2fb7e0b","yaeji":"https://p.scdn.co/mp3-preview/9a02a03a1549c3b27b66a2e152922ff7f7138ae6","juan-gabriel":"https://p.scdn.co/mp3-preview/9313ed81c965b56288b61bcff88a8271a12a78a5","bad-bunny":"https://p.scdn.co/mp3-preview/5c80aedfe75d2bc15aa0e803993c43395d8054fe?cid=5e546a6e15b04d54985d7d3538e3d5d5","cloudymane":"https://p.scdn.co/mp3-preview/7ed965d5e417a5aad558d203f02b49248fe57b72?cid=5e546a6e15b04d54985d7d3538e3d5d5","kobelocks":"https://p.scdn.co/mp3-preview/37a23d19a218128e0fa97d2915821c2ffe76ccc0?cid=5e546a6e15b04d54985d7d3538e3d5d5","scarlxrd":"https://p.scdn.co/mp3-preview/e65f8731b39d8fdb92d40c5cfd0d62faa8302b9f?cid=5e546a6e15b04d54985d7d3538e3d5d5","lei":"https://p.scdn.co/mp3-preview/0ba5bbee744c3f032ecaa44dff1766b2938c4ef0?cid=5e546a6e15b04d54985d7d3538e3d5d5"},"slides":[{"slide":"0","section":"1","text":[{"type":"h3","text":"<a href=https://pudding.cool/ target=_blank><strong class=pudding>The Pudding</strong></a> presents"},{"type":"h1","text":"You should look at this chart about <span class=emphasis>music genres</span>."}],"title":"Genres, ranked by streams on Spotify","figcaption":"table of genres ranked by the number of streams on Spotify in 2016"},{"slide":"1","section":"1","text":[{"type":"p","text":"In 2016, Spotify began publishing a list of the most popular music genres on its platform."}],"title":"Genres, ranked by streams on Spotify","figcaption":"table of genres ranked by the number of streams on Spotify in 2016"},{"slide":"2","section":"1","text":[{"type":"p","text":"Here's the list again, six years later in 2023."}],"title":"Genres, ranked by streams on Spotify","figcaption":"table of genres ranked by the number of streams on Spotify in 2016 and 2023 side by side"},{"slide":"3","section":"1","text":[{"type":"p","text":"I’ve highlighted the genres that were <strong class=emphasis>not in the top 25</strong> six years ago. Why did so many genres shift in popularity?"}],"title":"Genres, ranked by streams on Spotify","figcaption":"table of genres ranked by the number of streams on Spotify in 2016 and 2023 side by side where 2023 features several brand-new genres"},{"slide":"4","section":"1","text":[{"type":"p","text":"This led me down the rabbit hole of exploring the full list of Spotify’s genre database—all 6,000 of them."},{"type":"p","text":"The genre database is massive, and it’s changed the way that I think about music. But before we explore why Spotify is tracking 6,000 genres, let’s start with the preceding question##:## why are top genres so different in 2023 versus 2016?"}],"title":"Genres, ranked by streams on Spotify","figcaption":"table of genres ranked by the number of streams on Spotify in 2016 and 2023 side by side where 2023 features several brand-new genres"},{"slide":"5","section":"2","text":[{"type":"p","text":"In 2023, nearly half of the top 25 genres hail from <strong class=nonenglish>Latin America, Africa, and Asia.</strong>"}],"title":"Genres, ranked by streams on Spotify","figcaption":"table of genres ranked by the number of streams on Spotify in 2016 and 2023 side by side where 2023 features 9 times more genres that hail from Latin America, Africa, and Asia"},{"slide":"6","section":"2","text":[{"type":"p","text":"This shouldn’t be surprising."},{"type":"p","text":"Today, Spotify users from North America and Europe represent a much smaller share of streams than in 2016."}],"title":"Spotify Streams, by Region","figcaption":"bar chart of Spotify streams by region in 2016 and 2023 where the share of streams from North America and Europe represent a much smaller share of streams in 2023 than in 2016"},{"slide":"7","section":"2","text":[{"type":"p","text":"Every year, Spotify is available in more countries. Spotify added India in 2019. And South Korea in 2021.  Fittingly, you can see non##-##English genres begin to dominate in popularity."}],"title":"Genres, ranked by streams on Spotify","annotation":"The genre “Filmi” (music from Indian cinema) is now the 8th most-streamed genre.","figcaption":"bar chart of genres ranked by the number of streams on Spotify across 2016, 2019, 2021, and 2023 where non-English genres grow in popularity over time"},{"slide":"8","section":"2","text":[{"type":"p","text":"So many non-English genres have ascended in popularity##:## <strong class=emphasis>K-pop</strong> is, by far, the biggest gainer since 2016. Over the past 7 years, it grew to the 17th most##-##streamed genre."}],"title":"Genres, ranked by streams on Spotify","figcaption":"line chart of K-pop’s ranking by streams on Spotify over time where it climbs from #283 to #17 between 2016 and 2023"},{"slide":"9","section":"2","text":[{"type":"p","text":"<strong class=emphasis>K-pop</strong> now has more streams than <strong>r&b</strong> and <strong>edm</strong>."}],"title":"Genres, ranked by streams on Spotify","figcaption":"line chart of K-pop’s ranking by streams on Spotify over time compared to R&B and EDM where K-pop surpasses of them by 2023"},{"slide":"10","section":"2","text":[{"type":"p","text":"You’ve probably heard of <span id=bad-bunny-audio>Bad Bunny</span>, the world’s most##-##streamed musician, three years running. <strong class=emphasis>Reggaeton</strong> has similarly exhibited a <strong>K-pop</strong>##-##like ascent."}],"title":"Genres, ranked by streams on Spotify","figcaption":"line chart of reggaeton’s ranking by streams on Spotify over time compared to R&B and EDM where reggaeton also surpasses them both with a dramatic ascent over the last 7 years"},{"slide":"11","section":"2","text":[{"type":"p","text":"But is reggaeton seemingly pervasive because we’re finally counting popularity on a global stage? Is K##-##pop’s ascent driven by Spotify finally tapping into the taste of music fans in more countries?"},{"type":"p","text":"Popularity is such a self##-##fulfilling loop##:## we obsess over what’s popular (especially in the US), pushing top##-##charting artists further into the cultural spotlight."}],"figcaption":"word cloud of Spotify genres in the shape of a mountain where the genres we’ve discussed thus far are on the top"},{"slide":"12","section":"2","text":[{"type":"p","text":"Next, we’re going to look at what’s beyond the top 25. Music nerds, this section is for you."},{"type":"h2","text":"Below the top 25 ranking are genres #26 to #6,000 (and counting), all part of an on##-##going effort to catalog every music community."}],"figcaption":"word cloud of Spotify genres in the shape of a mountain where we have zoomed out to reveal hundreds more genres below"},{"slide":"13","section":"3","text":[{"type":"p","text":"This effort is continually evolving."},{"type":"p","text":"For example, <strong class=emphasis>latin</strong> reigned as a top 10 genre until it was dropped from Spotify's genre classification entirely in late 2022."}],"figcaption":"chart showing the genre Latin’s ranking by Spotify streams where it is removed from Spotify’s genre classifications after 2021"},{"slide":"14","section":"3","text":[{"type":"p","text":"Before it was removed, Latin seemed like a vestige of the record store days, a potpourri of anything Spanish##-##language, from Juan Gabriel to Bad Bunny."}],"figcaption":"bubble chart of examples of artists within the Latin genre where certain artists are clickable to play a sample of their music"},{"slide":"15","section":"3","text":[{"type":"p","text":"Spotify’s Latin genre already overlapped with other genres like Latin Pop, so Spotify removed it and subsequently added Urbano Latino to its genre list, which is narrower in scope than Latin, centered more on reggaeton and trap."}],"figcaption":"bubble chart of examples of artists within the genres of urbano Latino, Latin hip hop, Latin pop, musica Mexicana, and trap Latino where certain artists are clickable to play a sample of their music"},{"slide":"16","section":"3","text":[{"type":"p","text":"Hip hop and rock are similarly so broad that if I were to tell you that they were ranked #4 and #5 respectively, that wouldn’t say much."},{"type":"p","text":"For example, consider the different sounds of these “hip hop” tracks."}],"figcaption":"bubble chart of examples of artists within the hip hop genre where certain artists are clickable to play a sample of their music"},{"slide":"17","section":"3","text":[{"type":"p","text":"Hip hop has evolved so much over the past 50 years##;## today it’s a kaleidoscope of varied sounds and communities. Spotify has hundreds of genres that overlap with hip hop, and many were added in the past few years."}],"figcaption":"bubble chart of examples of artists within the Dream Plugg, Glitchcore, Dark Trap, and Phonk genres where certain artists are clickable to play a sample of their music"},{"slide":"18","section":"3","text":[{"type":"p","text":"So Spotify’s genre catalog not only recognizes the breadth of music within hip hop and other genres, but identifies new styles as well."},{"type":"p","text":"Here are the latest genres added in 2023 (note##:## some have always existed, but were just recently added to Spotify’s dataset)."}],"figcaption":"table of a sample of new genres added to Spotify’s classifications in 2023"},{"slide":"19","section":"3","text":[{"type":"p","text":"Some of these genres might seem made##-##up## by Spotify;## that’s because a few are. Glenn McDonald, who leads much of Spotify’s genre research, elaborated in an <a target=_blank href=https://open.spotify.com/episode/2qXXNqMVWQZ89QTtRWEXrj?si=09376bda34884085&nd=1 target=_blank>interview</a> that genres can come from users’ listening patterns."}],"quote":"“We do recognize the existence of genres that are mainly driven by listening patterns and not necessarily by the artists thinking of themselves as being peers… we can find clusters of listeners who share fondness for the same artists, even when it's not necessarily obvious that those artists share a style, and they don't necessarily come from the same place. But we can see that, yes, fans of these artists tend to be fans of the others.”"},{"slide":"20","section":"3","text":[{"type":"p","text":"An example of a genre driven by “listening patterns” includes escape room, Spotify’s 260th most streamed genre. McDonald <a target=_blank href=https://festivalpeak.com/what-is-escape-room-and-why%20-is-it-one-of-my-top-genres-on-spotify-a886372f003f target=_blank>describes it</a> as, “The vibe is kind of an underground##-##trap/PC##-##music/indietronic/activist##-##hip##-##hop kind of thing.”"}],"figcaption":"bubble chart of examples of artists within the Escape Room genre where certain artists are clickable to play a sample of their music"},{"slide":"21","section":"3","text":[{"type":"p","text":"This goes for older music too. Rock music is so diffuse that it makes sense to retroactively further catalog it. This includes, for example, <strong>mellow rock</strong> (<a target=_blank href=https://newsroom.spotify.com/2022-11-30/learn-about-those-music-genres-you-may-not-have-heard-of>which has</a> “elements of soft rock and folk rock, with emphasis on clean production, harmonies, and melodic compositions”)."}],"figcaption":"bubble chart of examples of artists within the Album Rock, Mellow Gold, and Neo Mellow genres where certain artists are clickable to play a sample of their music"},{"slide":"22","section":"3","text":[{"type":"p","text":"I’ve seen pushback to these genres, especially the ones that only exist in Spotify’s data. They often show up on the “top genres” list for users’ year##-##end report."}]},{"slide":"23","section":"3","text":[{"type":"p","text":"I get it. Spotify’s <strong>stomp and holler</strong> genre is <a target=_blank href=https://www.furia.com/page.cgi?type=log&id=427>described</a> by McDonald to include “those rousing neo##-##rustic folk/pop##-##ish artists, like Mumford & Sons and the Lumineers, that kind of sound like Dave Matthews ran over a jug band.”"},{"type":"p","text":"But I will never be caught dead saying, “I listen to stomp and holler.”"}],"figcaption":"bubble chart of examples of artists within the Stomp and Holler genre where certain artists are clickable to play a sample of their music"},{"slide":"24","section":"3","text":[{"type":"p","text":"Come to think about it, that goes for many nascent genres. If I described my music taste as drift phonk, math rock, or bedroom pop, it would sound cringey and pretentious."},{"type":"p","text":"That goes for new mainstream genres too. Spotify is credited with coining <strong>Hyperpop</strong>, which is now a part of popular culture and music discourse. But that didn’t stop it from being ridiculed."}]},{"slide":"25","section":"3","text":[{"type":"p","text":"Artists, especially, seem to struggle when their music is associated with new genres."},{"type":"p","text":"Consider Yacht Rock##:## coined in the late ’00s, it describes the feel##-##good ’80s grooves of bands like the Eagles, Doobie Brothers, and Daryl Hall & John Oates."},{"type":"p","text":"Yacht Rock is the 154th most popular genre on Spotify, even though John Oates (the “Oates” of Hall & Oates) had <a href=https://www.youtube.com/watch?v=ZiyCMKMOVAc target=_blank>never heard of the term</a>."}]},{"slide":"26","section":"3","text":[{"type":"p","text":"Artists rarely have control over how their music is categorized. Lil Nas X’s “Old Town Road” stirred controversy when it wasn’t initially classified as a country song by Billboard."},{"type":"p","text":"In a <a href=https://www.youtube.com/watch?v=yGirTQYZqCc target=_blank>post##-##award speech</a>, Tyler, the Creator pushed back at his Grammy nomination for Best Rap Album."}]},{"slide":"27","section":"3","text":[{"type":"p","text":"Tyler has a point. Billboard’s “Hot R&B/Hip##-##Hop Songs” chart was once named “Hot Black Singles” and even “Race Records,” all stemming from a 75##-##year effort to racially divide music charts."}],"title":"How the name of Billboard’s “Hot R&B” Chart has evolved","footer":"Source: <i>Categorizing Sound</i> by David Brackett.","figcaption":"table of how the name of Billboard’s Hot R&B chart has evolved where it was once called Race Records"},{"slide":"28","section":"3","text":[{"type":"p","text":"All of the pushback against genre classifications are valid, whether that’s inventing escape room and stomp & holler or what qualifies as r&b vs. pop."},{"type":"p","text":"But I still think an always##-##updating catalog of 6,000 genres is groundbreaking."}],"figcaption":"word cloud of genres in the shape of a mountain"},{"slide":"29","section":"3","text":[{"type":"h2","text":"I see this effort in the same way I see taxonomy##:## technically accurate, colloquially useless."},{"type":"p","text":"For centuries we had generic names to identify animals, such as “fish.” Everything from squid to crabs (and obviously jellyfish) were lumped into the same “fish” bucket."},{"type":"p","text":"But on closer inspection, most of these animals were not related at all. In a research context, scientists have drawn boundaries between animals that we mindlessly lumped together."}]},{"slide":"30","section":"3","text":[{"type":"p","text":"Similarly, the genre database adds much needed detail to broad categories, like hip hop and rock. For musicologists, it’s an anthropological gold mine. And for Spotify, it likely helps them better profile their users’ music tastes."},{"type":"p","text":"But these genres don’t necessarily work in casual conversation##:## you can describe your music taste as indie, even if, technically, Spotify says it’s escape room. The same goes for biology##:## people should call figs a fruit, even though it’s technically an inverted flower. Honey Badgers will always be badgers to me, even though they are more related to weasels."}],"title":"A small sample of genres within “indie” music","figcaption":"bubble chart of subgenres within the genre Indie where there are over 10 subgenres with very specific names"},{"slide":"31","section":"3","text":[{"type":"h2","text":"This approach means we can catalog music scenes that culture is typically too slow to name."},{"type":"p","text":"Hip hop officially celebrates its 50th anniversary this year, so 1973 marks its birth, the year that DJ Kool Herc mixed three breakbeats together. But it wasn’t until the late ’70s that “hip hop” was actually coined."}],"overlay":"“Rapper’s Delight” (1979), or “Old School Hip Hop” according to Spotify"},{"slide":"32","section":"3","text":[{"type":"p","text":"The same goes for the Velvet Underground and The Stooges, the progenitors of punk, who both preceded the phrase “punk music.”"},{"type":"p","text":"In 1969, Rolling Stone reviewed The Stooges first album, calling it, “Rock and Roll,” as well as “loud,” “high##-##powered,” and “raw energy.” Imagine the audacity should they have characterized it as the precipice of a new genre, “punk music.”"}],"overlay":"The Stooges, Goose Lake Festival, 1970 <span class=sub>(<a href=https://www.youtube.com/watch?v=v49d2hL3Oyk target_blank>full video</a>)</span>"},{"slide":"33","section":"3","text":[{"type":"p","text":"It’s hard to see how special something is, right in the moment."},{"type":"p","text":"If you’re old enough, you can look at the music scenes of your youth with awe, realizing that the pop music wasn’t just pop, but a marker of the era."},{"type":"p","text":"Right now, there’s some benign song that will, one day, represent a sound that’s quintessentially of the year 2023, and it will probably have a name."}],"overlay":"NSYNC at MTV Spring Break, 1999 <span class=sub>(at the time, this seemed normal and I never would have imagined it’d embody late ’90s aesthetics)</span>"},{"slide":"34","section":"3","text":[{"type":"p","text":"There are over 100,000 songs published to Spotify daily. To classify this music is to examine the petri dish of music culture—one that is mutating and evolving in mere months—and attempt to sort it."}],"title":"A Sample of the New Music from October 2023"},{"slide":"35","section":"3","text":[{"type":"p","text":"<a href=https://docs.google.com/spreadsheets/d/1BWHO9TLmCtJIKeC63HuVtjHfwb6iBOAxe-_HBFJ-FHI/edit#gid=1952369265 target=_blank>Here</a> is a historic view of Spotify’s genre dataset, which was scraped from <a href=https://everynoise.com/everynoise1d.cgi?vector=popularity&scope=all target=_blank>Every Noise at Once</a>."}]},{"slide":"36","section":"3","text":[{"type":"p","text":"This essay is by <a href=https://pudding.cool/author/matt-daniels/ target=_blank>Matt Daniels</a> with <a href=https://pudding.cool/author/michelle-mcghee/ target=_blank>Michelle McGhee</a>."},{"type":"p","text":"Subscribe to <a href=https://thepuddingmail.substack.com target=_blank>The Pudding's newsletter</a>. Consider supporting us on <a href=https://www.patreon.com/thepudding target=_blank>Patreon</a> too."}]}]}